<a href="https://colab.research.google.com/github/samp3209/datamining/blob/main/moredatatransformations.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import sklearn

In [45]:
data = pd.read_csv('melb_data.csv')
#print(data.shape)
#print(data.info())

data['Date'] = pd.to_datetime(data['Date'])
#data.Date.head()
data.Propertycount = data.Propertycount.astype('int')

#building a map for data['Type']
TypeMap = {'h':'house', 'u': 'unit', 't':'town_house'}
data.Type.replace(TypeMap).sample(10)
data.Type = data.Type.astype('category')
#data.Type.memory_usage()
#data.Date.dt.month.sample(10)
data.Address.str.capitalize().sample(10)
data.Suburb

0           Abbotsford
1           Abbotsford
2           Abbotsford
3           Abbotsford
4           Abbotsford
             ...
13575    Wheelers Hill
13576     Williamstown
13577     Williamstown
13578     Williamstown
13579       Yarraville
Name: Suburb, Length: 13580, dtype: object

In [46]:
data = pd.read_csv('marketing_data.csv')
data

         ID  Year_Birth   Education  ... Response Complain  Country
0      1826        1970  Graduation  ...        1        0       SP
1         1        1961  Graduation  ...        1        0       CA
2     10476        1958  Graduation  ...        0        0       US
3      1386        1967  Graduation  ...        0        0      AUS
4      5371        1989  Graduation  ...        1        0       SP
...     ...         ...         ...  ...      ...      ...      ...
2235  10142        1976         PhD  ...        0        0       US
2236   5263        1977    2n Cycle  ...        0        0       SP
2237     22        1976  Graduation  ...        0        0       SP
2238    528        1978  Graduation  ...        0        0      IND
2239   4070        1969         PhD  ...        1        0       CA

[2240 rows x 28 columns]